# capsLock -> ctrl
setxkbmap -option 'ctrl:nocaps'

--no-window-system


С-x + C-c     закрыть emacs

C-v           новая страница, опуститься вниз (видно 2 строки из прошой)
M-v           вернуться на прошлую страницу
C-l           очистить экран отобразить все заново, разместить текст так, что курсор по центру

      C-p
      /\
      ||
C-b <=  => C-f
      ||
      \/
      C-n
      
M-f           перемещаться вперед по словам
M-b           перемещаться назад по словам
C-a           перемещает в начало строки
C-e           перемещает в конец строки
M-a           перемещает в начало предложения
M-e           перемещает в конец предложения
M-<           в начало текста
M-<           в конец тееста

C-u           задать число повторений
C-g           отменить комманду
C-x           принимает число окон
C-x o         переключиться на другое окно
C-M-o         прокрутить другое окно
C-u 0 C-l     сделать текущую строку первой ?
C-l C-l       сделать текущую строку первой
C-x k C-f     добавить окно ?

C-d           кнопка delete
M-d           ctrl+delete
C-k           убить все до конца строки
M-k           убить все до конца предложения

C-space       выделить текст
С-w           удалить выделение

C-y           вставка вырезанного
M-y           вставка вырезанного перед вырезанным, запускает карусель со все вырезанным
M-w           копировать в буффер обмена

C-s           поиск вперед
С-r           поиск назад

C-/ or C-x u  undo

C-x C-f       открыть файл
C-x C-s       сохранить файл
C-x C-b       список файлов в буфере emacs
C-x C-b name  открыть буфер name
C-x b name    открыть буфер по имени
C-x s         сохнарить некоторые буферы, спросит о каждом
C-x k         удалить буффер

C-x 1         оставить один frame
C-x 2         добавить frame по горизонтали
C-x 3         добавить frame по вертикали
C-x 0         закрыть frame


C-x C-e       выполнить выделенный lisp код

M-x repl-s<Return>файл<Return>файлы<Return>     вы замените слово файл словом "файлы" везде, где оно встретится, ниже позиции курсора.
M-x recover-file<Return>.                       Когда у вас запросят подтверждение, наберите yes<Return>, чтобы восстановить автоматически сохраненные данные.

M-x fundamental-mode                            это команда, которая включает базовый (Fundamental) режим
M-x text mode                                   просто текст
M-x auto-fill-mode                              автоматически разрывает строку между словами в тех случаях, когда вставленный текст делает строку слишком длинной

M-x make-frame                создать еще фрейм/окно
M-x delete-frame              удалить фрейм

M-x toggle-truncate-lines     отключить переход на новую строку

C-h m         документация о текущем режиме
